Repository: shuiandy/Reframe
Catalog: Strings/*/ProfileEditorPage.resw
Source language: en_us
Languages: zh_cn

# BackButton.ToolTip
source: Back
zh_cn: 返回

# Title.Text
source: Edit profile
zh_cn: 编辑配置文件

# BasicHeader.Text
source: Basics
zh_cn: 基本

# NameBox.Header
source: Name
zh_cn: 名称

# MatchKindBox.Header
source: Match type
zh_cn: 匹配类型

# MatchKindProcess.Content
source: Process name
zh_cn: 进程名

# MatchKindTitle.Content
source: Window title (contains)
zh_cn: 窗口标题(包含)

# MatchKindTitleRegex.Content
source: Title regex
zh_cn: 标题正则

# MatchValueBox.Header
source: Match text
zh_cn: 匹配文本

# ExePathBox.Header
source: Executable (icon source)
zh_cn: 可执行文件(图标来源)

# ExePathBox.PlaceholderText
source: e.g. D:\Games\Zenless Zone Zero\ZenlessZoneZero.exe
zh_cn: 例如 D:\Games\Zenless Zone Zero\ZenlessZoneZero.exe

# BrowseExeButton.Content
source: Browse…
zh_cn: 浏览…

# ExePathHint.Text
source: Anti-cheat-protected games (Zenless Zone Zero, Genshin Impact, etc.) may not expose an icon. You can point to an .exe here to use as the icon source.
zh_cn: 反作弊保护的游戏(绝区零/原神等)可能取不到图标,可在此手动指定 exe 作为图标来源。

# LaunchCommandBox.Header
source: Launch command (optional)
zh_cn: 启动命令(可选)

# LaunchCommandBox.PlaceholderText
source: Leave empty to run the executable directly; or enter a launcher command or URI
zh_cn: 留空则直接运行可执行文件;可填启动器命令或 URI

# ResolutionExpander.Header
source: Startup resolution preset (Unity)
zh_cn: 启动分辨率预设 (Unity)

# ResolutionDesc.Text
source: For Unity games whose render resolution is pinned in the registry (e.g. Genshin Impact). Applied before the game launches; changes while it's running have no effect.
zh_cn: 适用于渲染分辨率钉死在注册表的 Unity 游戏(如原神)。启动游戏前生效;游戏运行中修改无效。

# ResEnabledToggle.Header
source: Enable startup resolution preset
zh_cn: 启用启动分辨率预设

# ResPathBox.Header
source: Registry path (relative under HKCU)
zh_cn: 注册表路径 (HKCU 下相对路径)

# ResPathBox.PlaceholderText
source: Software\miHoYo\Genshin Impact
zh_cn: Software\miHoYo\原神

# ResWidthBox.Header
source: Width
zh_cn: 宽

# ResHeightBox.Header
source: Height
zh_cn: 高

# ResWindowedCheck.Content
source: Windowed (Is Fullscreen mode = 0)
zh_cn: 窗口化 (Is Fullscreen mode = 0)

# BorderlessHeader.Text
source: Borderless
zh_cn: 无边框

# BorderlessToggle.Header
source: Remove window border
zh_cn: 去除窗口边框

# DelayBox.Header
source: Processing delay (ms)
zh_cn: 处理延迟 (毫秒)

# DelayBox.Description
source: Games rebuild their window during startup; 1000 is recommended
zh_cn: 游戏启动期会重建窗口,建议 1000

# RulesHeader.Text
source: Rules
zh_cn: 规则

# RulesHint.Text
source: (top to bottom; the first rule that matches the current monitor wins)
zh_cn: (自上而下,第一条命中当前显示器的规则生效)

# AddRuleButton.Text
source: Add rule
zh_cn: 添加规则

# AdvancedExpander.Header
source: Advanced
zh_cn: 高级

# OffsetsHeader.Text
source: Edge offsets (pixels)
zh_cn: 四边偏移 (像素)

# OffsetsDesc.Text
source: Fine-tuning applied to the final rectangle.
zh_cn: 施加在最终矩形上的微调。

# OffLeftBox.Header
source: Left
zh_cn: 左

# OffTopBox.Header
source: Top
zh_cn: 上

# OffRightBox.Header
source: Right
zh_cn: 右

# OffBottomBox.Header
source: Bottom
zh_cn: 下

# ExtraBehaviorHeader.Text
source: Extra behavior
zh_cn: 附加行为

# TopmostToggle.Header
source: Always on top
zh_cn: 始终置顶

# AspectToggle.Header
source: Keep aspect ratio
zh_cn: 保持宽高比

# MuteToggle.Header
source: Mute in background
zh_cn: 后台静音

# ClipToggle.Header
source: Confine cursor to window
zh_cn: 光标限制在窗口内

# ClientToggle.Header
source: Keep client-area size (not yet implemented)
zh_cn: 保持客户区大小 (暂未实装)

# MissingHint.Text
source: Profile not found.
zh_cn: 未找到该配置文件。

# CancelButton.Content
source: Cancel
zh_cn: 取消

# SaveButton.Content
source: Save
zh_cn: 保存

# MatchPlaceholderProcess
source: e.g. StarRail.exe
zh_cn: 例如 StarRail.exe

# MatchPlaceholderTitle
source: e.g. Genshin Impact
zh_cn: 例如 原神

# MatchPlaceholderTitleRegex
source: e.g. ^Honkai
zh_cn: 例如 ^崩坏

# RuleTitleFormat
source: Rule {0}
zh_cn: 规则 {0}

# RuleMoveUp
source: Move up
zh_cn: 上移

# RuleMoveDown
source: Move down
zh_cn: 下移

# RuleDelete
source: Delete
zh_cn: 删除

# MonitorConditionHeader
source: Monitor condition
zh_cn: 显示器条件

# MonitorAny
source: Any monitor
zh_cn: 任意显示器

# MonitorSpecific
source: Specific resolution
zh_cn: 指定分辨率

# MonitorWidth
source: Width
zh_cn: 宽

# MonitorHeight
source: Height
zh_cn: 高

# MonitorPickHeader
source: Pick from a connected monitor
zh_cn: 从当前显示器选

# ActionHeader
source: Action
zh_cn: 动作

# ActionNone
source: Leave geometry as-is
zh_cn: 不动几何

# ActionFullscreen
source: Fill
zh_cn: 铺满

# ActionZone
source: Snap to layout zone
zh_cn: 套布局分区

# ActionCustomRect
source: Custom rectangle
zh_cn: 自定义矩形

# ZoneLayoutHeader
source: Layout
zh_cn: 布局

# ZoneHeader
source: Zone
zh_cn: 分区

# NoLayoutsHint
source: No layouts yet. Create one on the “Layouts” page first.
zh_cn: 尚未创建任何布局,请先到“布局”页面新建。

# RectW
source: Width
zh_cn: 宽

# RectH
source: Height
zh_cn: 高

# PickRegionButton
source: Pick visually…
zh_cn: 可视化选择…

# UseWorkAreaCheck
source: Avoid the taskbar (use work area)
zh_cn: 避开任务栏(使用工作区)

# MoveOnlyCheck
source: Position only (don't resize)
zh_cn: 只定位(不调尺寸)

# MoveOnlyTooltip
source: Move only the window's top-left corner to the target, keeping the game's own size (avoids stretching). Use together with the startup resolution preset.
zh_cn: 只把窗口左上角移到目标位置,保持游戏自身尺寸不变(避免拉伸)。配合启动分辨率预设使用。

# PickMonitorTitle
source: Pick a monitor
zh_cn: 选择显示器

# PickMonitorPrimary
source: OK
zh_cn: 确定

# PickMonitorClose
source: Cancel
zh_cn: 取消

# MonitorPrimarySuffix
source: (primary)
zh_cn: (主屏)

# UnnamedLayout
source: Untitled layout
zh_cn: 未命名布局

# UnnamedZone
source: Untitled zone
zh_cn: 未命名分区
